.. _nid_userguide:

NID Strings
============

Introduction
------------

The function :func:`clean_mu_nid() <dataprep.clean.clean_mu_nid.clean_mu_nid>` cleans a column containing Mauritian national ID number (NID) strings, and standardizes them in a given format. The function :func:`validate_mu_nid() <dataprep.clean.clean_mu_nid.validate_mu_nid>` validates either a single NID strings, a column of NID strings or a DataFrame of NID strings, returning `True` if the value is valid, and `False` otherwise.

NID strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "J2906201304089"
* `standard`: NID strings with proper whitespace in the proper places. Note that in the case of NID, the compact format is the same as the standard one.
* `birthdate`: split the date parts from the number and return the birth date, like "2020-06-29".

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_mu_nid()` and `validate_mu_nid()`.

### An example dataset containing NID strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "nid": [
            'J2906201304089',
            'J2906201304088',
            '7542011030',
            '7552A10004',
            '8019010008', 
            "hello",
            np.nan,
            "NULL",
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "1111 S Figueroa St, Los Angeles, CA 90015",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

              nid                                           address
0  J2906201304089                                     123 Pine Ave.
1  J2906201304088                                           main st
2      7542011030                      1234 west main heights 57033
3      7552A10004                    apt 1 789 s maple rd manhattan
4      8019010008                robie house, 789 north main street
5           hello         1111 S Figueroa St, Los Angeles, CA 90015
6             NaN  (staples center) 1111 S Figueroa St, Los Angeles
7            NULL                                             hello

## 1. Default `clean_mu_nid`

By default, `clean_mu_nid` will clean nid strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_mu_nid
clean_mu_nid(df, column = "nid")

,nid,address,nid_clean
0,J2906201304089,123 Pine Ave.,J2906201304089
1,J2906201304088,main st,NaN
2,7542011030,1234 west main heights 57033,NaN
3,7552A10004,apt 1 789 s maple rd manhattan,NaN
4,8019010008,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_mu_nid(df, column = "nid", output_format="standard")

,nid,address,nid_clean
0,J2906201304089,123 Pine Ave.,J2906201304089
1,J2906201304088,main st,NaN
2,7542011030,1234 west main heights 57033,NaN
3,7552A10004,apt 1 789 s maple rd manhattan,NaN
4,8019010008,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `compact`

In [4]:
clean_mu_nid(df, column = "nid", output_format="compact")

,nid,address,nid_clean
0,J2906201304089,123 Pine Ave.,J2906201304089
1,J2906201304088,main st,NaN
2,7542011030,1234 west main heights 57033,NaN
3,7552A10004,apt 1 789 s maple rd manhattan,NaN
4,8019010008,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `birthdate`

In [5]:
clean_mu_nid(df, column = "nid", output_format="birthdate")

,nid,address,nid_clean
0,J2906201304089,123 Pine Ave.,2020-06-29
1,J2906201304088,main st,NaN
2,7542011030,1234 west main heights 57033,NaN
3,7552A10004,apt 1 789 s maple rd manhattan,NaN
4,8019010008,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned NID strings is added with a title in the format `"{original title}_clean"`.

In [6]:
clean_mu_nid(df, column="nid", inplace=True)

        nid_clean                                           address
0  J2906201304089                                     123 Pine Ave.
1             NaN                                           main st
2             NaN                      1234 west main heights 57033
3             NaN                    apt 1 789 s maple rd manhattan
4             NaN                robie house, 789 north main street
5             NaN         1111 S Figueroa St, Los Angeles, CA 90015
6             NaN  (staples center) 1111 S Figueroa St, Los Angeles
7             NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [7]:
clean_mu_nid(df, "nid", errors="coerce")

,nid,address,nid_clean
0,J2906201304089,123 Pine Ave.,J2906201304089
1,J2906201304088,main st,NaN
2,7542011030,1234 west main heights 57033,NaN
3,7552A10004,apt 1 789 s maple rd manhattan,NaN
4,8019010008,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `ignore`

In [8]:
clean_mu_nid(df, "nid", errors="ignore")

,nid,address,nid_clean
0,J2906201304089,123 Pine Ave.,J2906201304089
1,J2906201304088,main st,J2906201304088
2,7542011030,1234 west main heights 57033,7542011030
3,7552A10004,apt 1 789 s maple rd manhattan,7552A10004
4,8019010008,"robie house, 789 north main street",8019010008
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",hello
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 4. `validate_mu_nid()`

`validate_mu_nid()` returns `True` when the input is a valid NID. Otherwise it returns `False`.

The input of `validate_mu_nid()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_mu_nid()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_mu_nid()` returns the validation result for the whole DataFrame.

In [9]:
from dataprep.clean import validate_mu_nid
print(validate_mu_nid('J2906201304089'))
print(validate_mu_nid('J2906201304088'))
print(validate_mu_nid('7542011030'))
print(validate_mu_nid('7552A10004'))
print(validate_mu_nid('8019010008'))
print(validate_mu_nid("hello"))
print(validate_mu_nid(np.nan))
print(validate_mu_nid("NULL"))

True
False
False
False
False
False
False
False

### Series

In [10]:
validate_mu_nid(df["nid"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: nid, dtype: bool

### DataFrame + Specify Column

In [11]:
validate_mu_nid(df, column="nid")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: nid, dtype: bool

### Only DataFrame

In [12]:
validate_mu_nid(df)

     nid  address
0   True    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False
7  False    False